Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Let's keep extending on our simple HTML page that contains the item name, price and add a discounted price. The discounted price is sometimes called a "computed property". We will implement a template extension method to render this property easily. Let's update our template:
ja_jp: アイテム名、価格、値引き価格を含むシンプルな HTML ページを拡張していきましょう。値引き価格は「計算プロパティー」と呼ばれることがあります。このプロパティーを簡単にレンダリングするためのテンプレート拡張メソッドを実装します。テンプレートを更新してみましょう。

source: Let's keep it simple: the deployment module is what will be used at build time, the runtime module is what will be used at runtime.
ja_jp: 簡単に説明しますと、デプロイメントモジュールはビルド時に使用されるもので、ランタイムモジュールは実行時に使用されるものです。

source: Let's look at the `ServiceLoader` case in more detail, it's particularly interesting.
ja_jp: `ServiceLoader` のケースを詳しく見てみましょう。これは特に興味深いものです。

source: Let's look at the classic 'Hello World' type example. To do this the Quarkus way we would create a recorder as follows:
ja_jp: 典型的な「Hello World」タイプの例を見てみましょう。これをQuarkusの方法で行うには、次のようにレコーダーを作成します。

source: Let's look at what happens when we start pulling levers. In the examples below, pay attention to punctuation in config, as that will be the key to why things behave the way they do.
ja_jp: レバーを引き始めると何が起こるかを見てみましょう。以下の例では、config の句読点に注意を払ってください。句読点が、そのように動作する鍵となるからです。

source: Let's make one more commit here with "build: Configure distribution artifacts" as message. We can create a release right now, by invoking a different goal: `./mvnw -Prelease jreleaser:release -Djreleaser.select.current.platform`. This will create a Git release at the chosen repository, which includes tagging the repository, uploading the changelog, all distribution artifacts and their checksum as release assets.
ja_jp: ここで、ビルド: 配布アーティファクトの設定をメッセージとしてもう 1 つコミットしてみましょう。別のゴール `./mvnw -Prelease jreleaser:release -Djreleaser.select.current.platform` を呼び出すことで、今すぐリリースを作成できます。これにより、選択したリポジトリーに Git リリースが作成されます。これには、リポジトリーのタグ付け、変更ログのアップロード、すべての配布アーティファクト、およびそれらのチェックサムがリリースアセットとして含まれます。

source: Let's make our recommendations feature even better by providing a fallback (and presumably faster) way of getting related coffees.
ja_jp: 関連するコーヒーを入手するための代替手段（おそらくより迅速な方法）を提供することで、おすすめ機能をさらに改善しましょう。

source: Let's make the application a bit more interactive. Open the project in your IDE and navigate to `src/main/java/org/acme/GreetingResource.java` Add a query param in the `hello` method. (The `org.jboss.resteasy.reactive.RestQuery` annotation is like the Jakarta REST `@QueryParam` annotation, except you don't need to duplicate the parameter name.)
ja_jp: アプリケーションをもう少しインタラクティブにしてみましょう。 IDE でプロジェクトを開き、 `src/main/java/org/acme/GreetingResource.java` に移動します。 `hello` メソッドにクエリーパラメーターを追加します。 (`org.jboss.resteasy.reactive.RestQuery`アノテーションは Jakarta REST の `@QueryParam` アノテーションに似ています。 ただし、パラメーター名を複製する必要はありません。)

source: Let's make this application a Git repository:
ja_jp: このアプリケーションを Git リポジトリーにしてみましょう。

source: Let's measure how much RSS a Quarkus native executable takes on startup on this particular environment:
ja_jp: この特定の環境で、Quarkusのネイティブ実行可能ファイルが起動時にどれだけのRSSを消費するかを測定してみましょう:

source: Let's modify the application and add a companion bean.
ja_jp: アプリケーションを修正してコンパニオンクラスの Bean を追加してみます。

source: Let's modify the application and add a companion bean. Create the `src/main/java/org/acme/GreetingService.java` file with the following content:
ja_jp: アプリケーションを変更してコンパニオン Bean を追加してみましょう。 以下の内容で `src/main/java/org/acme/getting/started/GreetingService.java` ファイルを作成してください。

source: Let's now add the ability to add and delete heroes to our GraphQL API.
ja_jp: それでは、GraphQL APIにヒーローの追加と削除の機能を追加してみましょう。

source: Let's now combine Resteasy _reactive_, Hibernate ORM _classic_ and Kafka to persist an entity and write it to a Kafka topic:
ja_jp: それでは、Resteasy _reactive_、Hibernate ORM _classic_、Kafkaを組み合わせて、エンティティを永続化し、それをKafkaトピックに書き込んでみましょう。

source: Let's now create the `Result` class as an inner class:
ja_jp: それでは、 `Result` クラスをインナークラスとして作成してみましょう。

source: Let's now implement a new HTTP endpoint that queries the Wikipedia API to retrieve the pages about Quarkus in the different languages. Add the following method to the `VertxResource` class:
ja_jp: それでは、Wikipedia APIに問い合わせ、Quarkusに関するさまざまな言語のページを取得する新しいHTTPエンドポイントを実装してみましょう。 `VertxResource` クラスに以下のメソッドを追加します：

source: Let's now instruct the learner to create a simple endpoint using the imaginary `@Anvil` annotation.
ja_jp: それでは、架空の `@Anvil` アノテーションを使用して、単純なエンドポイントを作成するよう学習者に指示しましょう。

source: Let's now look at the other side and retrieve the movies from AMQP.
ja_jp: 今度は反対側に目を向けて、AMQPからムービーを取得してみましょう。

source: Let's now look at the other side and retrieve the movies from Kafka.
ja_jp: 今度は反対側に目を向けて、Kafkaからムービーを取り出してみましょう。

source: Let's now look at the second method. It retrieves all the stored elements. In this case, it returns multiple items (one per stored element), so we are using a `Multi`. As for the insertion, getting the stored elements involves I/Os. The `find` is our operation. As for Uni, you need to subscribe to trigger the operation. The subscriber receives item events, a failure event, or a completion event when all the elements have been received.
ja_jp: 次に、2つ目のメソッドを見てみましょう。これは、格納されているすべての要素を取得します。この場合、複数のアイテム（格納されている要素ごとに1つ）を返しますので、 `Multi` を使用しています。挿入については、保存されている要素の取得にはI/Oが必要です。 `find` が私たちの操作です。Uniに関しては、オペレーションをトリガーするためにサブスクライブする必要があります。サブスクライバーは、アイテムイベント、失敗イベント、またはすべての要素を受信したときの完了イベントを受け取ります。

source: Let's now try deleting an entry:
ja_jp: それでは、エントリーを削除してみましょう。

source: Let's open the `MovieResource`, inject an https://quarkus.io/blog/reactive-messaging-emitter/[`Emitter`] of `Movie` DTO and implement a `@POST` method that consumes `Movie` and sends it through the `Emitter`:
ja_jp: `MovieResource` を開き、`Movie` DTO の https://quarkus.io/blog/reactive-messaging-emitter/[`Emitter`] を挿入し、`Movie` を消費する `@POST` メソッドを実装して `Emitter` 経由で送信してください。

source: Let's pause for a moment. **We were able to start a Quarkus REST application in the JVM in just `80 ms`**.
ja_jp: ここで少し立ち止まりましょう。**JVM で Quarkus REST アプリケーションをわずか `80 ms` で起動できました**。

source: Let's proceed to create some beans using various Spring annotations.
ja_jp: それでは、さまざまなSpringアノテーションを使って、いくつかのBeanを作成してみましょう。

source: Let's regenerate the native executable. This time, because of the configured compression level, Quarkus will compress it:
ja_jp: ネイティブ実行可能ファイルを再生成してみましょう。今回は、設定された圧縮レベルのため、Quarkusが圧縮します。

source: Let's repeat the query after modifying the browser style and moving the nodes to clearly view them:
ja_jp: ブラウザのスタイルを変更し、ノードを移動してはっきりと見えるようにしてから、クエリを繰り返してみましょう。

source: Let's revert the changes we made to the configuration file and go back to SSL with the following command:
ja_jp: 設定ファイルに変更した内容を元に戻し、以下のコマンドでSSLを有効に戻してみましょう。

source: Let's revisit a greeting HTTP endpoint and use asynchronous message passing to delegate the call to a separated bean. It uses the request/reply dispatching mechanism. Instead of implementing the business logic inside the JAX-RS endpoint, we are sending a message. Another bean consumes this message, and the response is sent using the _reply_ mechanism.
ja_jp: greeting HTTPエンドポイントに戻り、非同期メッセージパッシングを使用して呼び出しを別のBeanに委譲しましょう。 要求/応答ディスパッチメカニズムを使用します。 JAX-RSエンドポイント内にビジネスロジックを実装する代わりに、メッセージを送信しています。 別のBeanがこのメッセージを消費し、_応答_ メカニズムを使用して応答が送信されます。

source: Let's revisit a greeting HTTP endpoint and use asynchronous message passing to delegate the call to a separated bean. It uses the request/reply dispatching mechanism. Instead of implementing the business logic inside the JAX-RS endpoint, we are sending a message. This message is consumed by another bean and the response is sent using the _reply_ mechanism.
ja_jp: greeting HTTP エンドポイントを再訪し、非同期メッセージパッシングを使用して分離された Bean に呼び出しを委譲してみましょう。リクエスト/レスポンスディスパッチの仕組みを利用しています。JAX-RS エンドポイント内にビジネスロジックを実装する代わりに、メッセージを送信しています。このメッセージは別の Bean によってコンシュームされ、応答は _返信_ メカニズムを使用して送信されます。

source: Let's revisit a greeting HTTP endpoint and use asynchronous message passing to delegate the call to a separated bean. It uses the request/reply dispatching mechanism. Instead of implementing the business logic inside the Jakarta REST endpoint, we are sending a message. Another bean consumes this message, and the response is sent using the _reply_ mechanism.
ja_jp: グリーティングHTTPエンドポイントに戻りましょう。非同期メッセージパッシングを使用して、別のBeanへの呼出に委譲してみましょう。これは、request/replyディスパッチメカニズムを使用しています。Jakarta RESTエンドポイント内でビジネスロジックを実装する代わりに、メッセージを送信しています。別の Bean がこのメッセージを消費し、応答は _reply_ メカニズムを使用して送信されます。

source: Let's revisit a greeting HTTP endpoint and use asynchronous message passing to delegate the call to a separated bean. It uses the request/reply dispatching mechanism. Instead of implementing the business logic inside the Jakarta REST endpoint, we are sending a message. This message is consumed by another bean and the response is sent using the _reply_ mechanism.
ja_jp: グリーティングHTTPエンドポイントをもう一度修正し，非同期メッセージパッシングを使用して，呼び出しを別のBeanに委譲してみよう。これは、request/replyディスパッチ機構を使用しています。Jakarta RESTエンドポイント内でビジネスロジックを実装する代わりに、メッセージを送信しています。このメッセージは別の Bean によって消費され、応答は _reply_ メカニズムを使用して送信されます。

source: Let's rewrite our application using reactive programming with Mutiny.
ja_jp: Mutiny でリアクティブプログラミングを使用してアプリケーションを書き換えてみましょう。

source: Let's say for example that we wanted to filter out logging records that contained a part of text from the console logs. The text itself is part of the application configuration and is not hardcoded. We could write a filter like so:
ja_jp: 例えば、コンソールログからテキストの一部を含むロギングレコードをフィルタリングしたいとしましょう。テキスト自体はアプリケーションの設定の一部であり、ハードコードされていません。このようなフィルタを書くことができます。

source: Let's say instead of the `GreetingResource` class from above, you have something more complex. You will need additional work on top of the changes from the <<starting-point>>.
ja_jp: 上記の `GreetingResource` クラスの代わりに、もっと複雑なものがあるとします。<<starting-point>> からの変更に加えて、追加の作業が必要になります。

source: Let's say we want a composite Key using `java.time.LocalDate`.
ja_jp: `java.time.LocalDate` を使用して複合キーを作成するとします。

source: Let's say we want to test the following processor application:
ja_jp: 以下のプロセッサーアプリケーションをテストするとします。

source: Let's say we want to test the following sample application:
ja_jp: 以下のサンプルアプリケーションをテストするとします。

source: Let's say you want to update some rows and compute the total number of affected rows. You must inspect each `RowSet`:
ja_jp: いくつかの行を更新し、影響を受ける行の総数を計算するとします。各 `RowSet` を検査する必要があります。

source: Let's say you want to use an entity in a blocking managed session code, but also in a reactive stateless code: this is possible no matter which supertype of your entity you picked. You should pick the supertype that represents your majority of use-cases, but any one you pick, you can always obtain the alternative operations by using the `.statelessReactive()` method on the entity:
ja_jp: エンティティーをブロッキング管理セッションコードと、リアクティブステートレスコードの両方で使用したいとしましょう。これは、エンティティーのどのスーパータイプを選択しても可能です。ほとんどのユースケースを表すスーパータイプを選択すべきですが、どれを選んだとしても、エンティティーで `.statelessReactive()` メソッドを使用することで、常に代替操作を取得できます。

source: Let's see an example about how to configure a secured Route using passthrough termination by simply adding the "quarkus.openshift.route.tls" properties:
ja_jp: "Quarkus.openshift.route.tls" プロパティを追加するだけで、パススルー終端を使用して保護されたRouteを設定する方法の例を見てみましょう：

source: Let's see an example about how to provide the HTTP Client Options via CDI:
ja_jp: ここでは、CDIを使用してHTTPクライアントオプションを提供する方法について、例を挙げて説明します:

source: Let's see an example about how to register your own custom redirect handler using the `@ClientRedirectHandler` annotation:
ja_jp: `@ClientRedirectHandler` アノテーションを使用して独自のカスタムリダイレクトハンドラーを登録する方法の例を見てみましょう。

source: Let's see an example of how to implement a gRPC service using virtual threads. First, make sure to have the gRPC extension dependency in your build file:
ja_jp: 仮想スレッドを使用した gRPC サービスの実装方法について説明します。 まず、ビルドファイルに gRPC エクステンションの依存関係があることを確認します。

source: Let's see an example of how to process Kafka records on virtual threads. First, make sure to have a reactive messaging extension dependency to your build file:
ja_jp: 仮想スレッドで Kafka レコードを処理する方法の例を見てみましょう。 まず、ビルドファイルにリアクティブメッセージングエクステンションの依存関係があることを確認します。

source: Let's see an example using PostgreSQL where we'll map a file system volume to keep the database data permanently and use it:
ja_jp: PostgreSQL を使用して、データベースデータを永続的に保持するためにファイルシステムボリュームをマッピングして使用する例を見てみましょう:

source: Let's see an example using PostgreSQL where we'll map a file system volume to keep the database data permantently and use it:
ja_jp: PostgreSQLを使い、データベースのデータを永続化するファイルシステムのボリュームをマッピングして使う例をみてみましょう:

source: Let's see how Permission Based Access Control constraints can be applied to `ApiEchoService`.
ja_jp: 権限ベースのアクセス制御の制約を `ApiEchoService` に適用する方法を見てみましょう。

source: Let's see how all of this looks in practice, with the usual `all-in-one` Grafana usage, in the form of https://github.com/grafana/docker-otel-lgtm[OTel-LGTM] Docker image.
ja_jp: https://github.com/grafana/docker-otel-lgtm[OTel-LGTM] Docker イメージの形式で、通常の `all-in-one` Grafana の使用方法を使用して、これらすべてが実際にどのように見えるかを確認しましょう。

source: Let's see how it works with the Redis `TokenStateManager`.
ja_jp: Redis `TokenStateManager` でどのように動作するか見てみましょう。

source: Let's see how to use Compose Dev Services with examples ranging from simple to more complex scenarios.
ja_jp: 簡単なシナリオからより複雑なシナリオまで、例を挙げて Compose Dev Services の使用方法を見ていきましょう。

source: Let's see how we can solve this issue by developing a custom extension.
ja_jp: この問題を解決するために、カスタムエクステンションを開発する方法を見てみましょう。

source: Let's see how you can do conditional request validation using the link:{jaxrsapi}/jakarta/ws/rs/core/Request.html[`Request`] context object:
ja_jp: link:{jaxrsapi}/jakarta/ws/rs/core/Request.html[`Request`] コンテキストオブジェクトを使用して、条件付きリクエスト検証を実行する方法を見ていきます。

source: Let's see how you can do conditional request validation using the link:{jaxrsapi}/javax/ws/rs/core/Request.html[`Request`] context object:
ja_jp: link:{jaxrsapi}/javax/ws/rs/core/Request.html[`Request`] コンテキストオブジェクトを使用して、条件付きリクエスト検証を行う方法を見てみましょう。

source: Let's see how you can do it with Hibernate Search.
ja_jp: それでは、Hibernate Searchを使ってどのように設定できるのか見てみましょう。

source: Let's see it in action by adding a `@RegisterClientHeaders` annotation pointing to a `RequestUUIDHeaderFactory` class in our `ExtensionsService` REST interface:
ja_jp: `ExtensionsResource` REST インタフェースに `@RegisterClientHeaders` アノテーションを追加して、 `RequestUUIDHeaderFactory` クラスを指すようにしてみましょう。

source: Let's see what happens if we start from one day in the future using the `http://localhost:8080/weather?city=Raleigh&daysInFuture=1` URL. You should get an answer two seconds later since two of the requested days were already loaded in the cache.
ja_jp: URL `http://localhost:8080/weather?city=Raleigh&daysInFuture=1` を使って未来のある日から始めるとどうなるか見てみましょう。要求された日のうち2つはすでにキャッシュに読み込まれていたので、2秒後に回答が得られるはずです。

source: Let's set that aside for now.
ja_jp: それはひとまず置いておきましょう。

source: Let's show the code of the `findAllBlocking()` method we used in the first example
ja_jp: 最初の例で使用した `findAllBlocking()` メソッドのコードを表示してみましょう。

source: Let's start a Redis server on the port 6379 using:
ja_jp: 以下の形で6379番ポートでRedisサーバを起動してみましょう:

source: Let's start again with a clean slate
ja_jp: クリーンな状態でもう一回

source: Let's start again with the template:
ja_jp: 改めてテンプレートから始めてみましょう。

source: Let's start an Infinispan server on the port 11222 using:
ja_jp: 以下を使って11222番ポートでInfinispanサーバを起動してください:

source: Let's start by creating a service that will simulate an extremely slow call to the external meteorological service. Create `src/main/java/org/acme/cache/WeatherForecastService.java` with the following content:
ja_jp: まずは、外部気象サービスへの非常に遅い呼び出しをシミュレートするサービスを作成してみましょう。以下の内容で `src/main/java/org/acme/cache/WeatherForecastService.java` を作成します。

source: Let's start by creating a service which will simulate an extremely slow call to an external meteorological service. Create `src/main/java/org/acme/spring/cache/WeatherForecastService.java` with the following content:
ja_jp: まずは、外部の気象サービスへの非常に遅い呼び出しをシミュレートするサービスを作成してみましょう。以下の内容で `src/main/java/org/acme/spring/cache/WeatherForecastService.java` を作成します。

source: Let's start by implementing `ProtectedResource`:
ja_jp: まずは `ProtectedResource` を実装することから始めましょう。

source: Let's start by implementing the `/api/public` endpoint to allow all users access to access the application. Add a regular JAX-RS resource to your Java source code, as outlined in the following code snippet:
ja_jp: まず、すべてのユーザーがアプリケーションにアクセスできるように、 `/api/public` エンドポイントを実装しましょう。 次のコードスニペットのように、通常のJAX-RSリソースをJavaソースコードに追加してください:

source: Let's start by implementing the `/api/public` endpoint. As you can see from the source code below, it is just a regular JAX-RS resource:
ja_jp: `/api/public` エンドポイントの実装から始めましょう。以下のソースコードから分かるように、通常のJAX-RSリソースです:

source: Let's start by implementing the `/api/public` endpoint. As you can see from the source code below, it is just a regular Jakarta REST resource:
ja_jp: まず、 `/api/public` のエンドポイントを実装することから始めましょう。以下のソースコードからわかるように、これは通常のJakarta RESTリソースに過ぎません:

source: Let's start by implementing the `/api/users/me` endpoint. As you can see from the source code below it is just a regular JAX-RS resource:
ja_jp: まずは `/api/users/me` エンドポイントを実装してみましょう。下のソースコードを見るとわかるように、これは通常の JAX-RS リソースです。

source: Let's start by implementing the `/api/users/me` endpoint. As you can see from the source code below it is just a regular Jakarta REST resource:
ja_jp: まず、 `/api/users/me` のエンドポイントを実装することから始めましょう。以下のソースコードからわかるように、これは通常の Jakarta REST リソースです:

source: Let's start by implementing the `/{tenant}` endpoint. As you can see from the source code below it is just a regular JAX-RS resource:
ja_jp: まずは `/{tenant}` エンドポイントを実装してみましょう。下のソースコードを見るとわかるように、これは通常の JAX-RS リソースです。

source: Let's start by implementing the `/{tenant}` endpoint. As you can see from the source code below it is just a regular Jakarta REST resource:
ja_jp: `/{tenant}` エンドポイントを実装することから始めます。以下のソースコードからわかるように、これは単なる通常の Jakarta REST リソースです。

source: Let's start by implementing the simple data object `Person`. As you can see from the source code below it is just a POJO:
ja_jp: まずはシンプルなデータオブジェクト `Person` を実装してみましょう。下のソースコードを見ればわかるように、ただのPOJOです。

source: Let's start cooking
ja_jp: 調理をはじめよう

source: Let's start from an empty application created with the Quarkus Maven plugin:
ja_jp: Quarkus Mavenプラグインで作成した空のアプリケーションから始めてみましょう:

source: Let's start from the application domain model.
ja_jp: アプリケーションドメインモデルから始めましょう。

source: Let's start from the application domain model. This application will approve Loan Applications so we have a class with all the details of the wanted Loan:
ja_jp: まず、アプリケーションのドメインモデルから始めましょう。このアプリケーションはローンの申請を承認するものなので、希望するローンのすべての詳細を持つクラスを用意します。

source: Let's start from the application domain model. This application will approve Loan Applications, so we have a class with all the details of the wanted Loan:
ja_jp: まず、アプリケーションのドメインモデルから始めましょう。このアプリケーションはローンの申請を承認するものなので、希望するローンのすべての詳細を持つクラスを用意します:

source: Let's start looking at our quickstart code so that you can understand how Knative Events map to Funqy. Open up link:{quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/java/org/acme/funqy/SimpleFunctionChain.java[SimpleFunctionChain.java]
ja_jp: まずはクイックスタートコードを見て、Knative EventsとFunqyの対応関係を理解しましょう。 link:{quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/java/org/acme/funqy/SimpleFunctionChain.java[SimpleFunctionChain.java] を開いてください。

source: Let's start looking at our quickstart code so that you can understand how Knative Events map to Funqy. Open up {quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/java/org/acme/funqy/SimpleFunctionChain.java[SimpleFunctionChain.java]
ja_jp: Knative イベントがどのように Funqy にマップされるかを理解するために、クイックスタートのコードを見てみましょう。クイックスタートコードは、 {quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/java/org/acme/funqy/SimpleFunctionChain.java[SimpleFunctionChain.java] を開いてください。

source: Let's start our application in dev mode:
ja_jp: それでは、アプリケーションをdevモードで起動してみましょう:

source: Let's start the Jaeger-all-in-one Docker image, where we will retrieve and see the captured traces:
ja_jp: Jaeger-all-in-one Docker イメージを起動して、キャプチャーされたトレースを取得して確認してみましょう。

source: Let's start with a Hello World template:
ja_jp: まずは Hello World テンプレートから始めましょう。

source: Let's start with a simple _Hello_ service. Create the `src/main/proto/helloworld.proto` file with the following content:
ja_jp: まずは簡単な _Hello_ サービスから始めてみましょう。 `src/main/proto/helloworld.proto` ファイルを以下の内容で作成します。

source: Let's start with explicit logout operations.
ja_jp: 最初に、明示的なログアウト操作について説明します。

source: Let's start with the `Fruit` entity.Create the `src/main/java/org/acme/hibernate/orm/panache/Fruit.java` file with the following content:
ja_jp: では、 `Fruit` から始めましょう。以下の内容で `src/main/java/org/acme/hibernate/orm/panache/Fruit.java` ファイルを作成します。

source: Let's start with the `getAll` method. The `getAll` method returns all the fruits stored in the database. In the `FruitResource`, add the following code:
ja_jp: まずは、 `getAll` のメソッドから見てみましょう。 `getAll` メソッドは、データベースに保存されているすべてのフルーツを返します。 `FruitResource` の中に、以下のコードを追加します。

source: Let's start with the https://how-to.vertx.io/web-and-oauth2-oidc/[Securing a Web Application with OAuth2/OpenID Connect] `how-to` tutorial.
ja_jp: https://how-to.vertx.io/web-and-oauth2-oidc/[Securing a Web Application with OAuth2/OpenID Connect] `how-to` チュートリアルから始めましょう。

source: Let's start with the very beginning, getting a new project structure with the right dependencies. Go to https://code.quarkus.io, enter your group id and artifact id. Then in the extension list, select:
ja_jp: 最初の一歩として、正しい依存関係を持つ新しいプロジェクト構造を取得してみましょう。 https://code.quarkus.io にアクセスして、グループIDとアーティファクトIDを入力します。そして、エクステンションのリストで以下を選択します:

source: Let's start with the very beginning: the service we will discover, select and call.
ja_jp: 一番最初から始めましょう:私たちが発見（ディスカバリー）し、選択（セレクション）し、呼び出すサービスです。

source: Let's start with updating the `pom.xml`, it should look like this:
ja_jp: まず `pom.xml` の更新から始めましょう。以下のようになるはずです。

source: Let's suppose the have a `SampleService` bean whose `get()` method returns a list of samples.
ja_jp: `SampleService` Beanがあり、その `get()` メソッドがサンプルのリストを返すとしましょう。

source: Let's suppose there are couple of extensions `quarkus-blue` and `quarkus-red` in an application that provide Java options for Dev mode. The logs may look something like this
ja_jp: たとえば、アプリケーションに、開発モード用の Java オプションを提供する 2 つのエクステンション (`quarkus-blue` と `quarkus-red`) があるとします。 その場合のログは次のようになります

source: Let's suppose we have a `SampleService` bean whose `get()` method returns a list of samples.
ja_jp: `SampleService` Beanがあり、その `get()` メソッドがサンプルのリストを返すとしましょう。

source: Let's suppose we have a simple class like this:
ja_jp: このようなシンプルなクラスがあったとしましょう:

source: Let's take `io.quarkiverse.aloha:quarkus-aloha` as an example extension GAV (don't look for this extension, it doesn't exist).
ja_jp: エクステンション GAV の例として `io.quarkiverse.aloha:quarkus-aloha` を見てみましょう (このエクステンションは存在しませんので探さないでください)。

source: Let's take a progressive approach to learning how to use Hibernate with Panache, and start with a simple entity.
ja_jp: Hibernate with Panache の使い方を学ぶために段階的なアプローチをとり、シンプルなエンティティから始めましょう。

source: Let's take a step back
ja_jp: 一歩下がって考えてみましょう

source: Let's take an example:
ja_jp: 例を挙げてみましょう:

source: Let's take the example of an MQTT broker:
ja_jp: MQTT ブローカーの例を見てみましょう:
